### Report for environment: dev

#### Terraform Format and Style 🖌``
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Upgrading modules...
- deductions-core in modules/deductions-core
Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.5.2 for deductions-core.vpc...
- deductions-core.vpc in .terraform/modules/deductions-core.vpc
- deductions-private in modules/deductions-private
- deductions-private.mq-admin in modules/deductions-private/mq-admin
Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.5.2 for deductions-private.vpc...
- deductions-private.vpc in .terraform/modules/deductions-private.vpc
Downloading registry.terraform.io/terraform-aws-modules/dynamodb-table/aws 4.0.0 for ehr_transfer_tracker_dynamodb_table...
- ehr_transfer_tracker_dynamodb_table in .terraform/modules/ehr_transfer_tracker_dynamodb_table
- repo in modules/mhs
- repo.cluster in modules/mhs/cluster-network
- test-harness in modules/mhs
- test-harness.cluster in modules/mhs/cluster-network
- utils in modules/utils
Initializing provider plugins...
- Finding latest version of hashicorp/archive...
- Finding hashicorp/aws versions matching ">= 5.20.0, >= 5.21.0, 5.37.0"...
- Installing hashicorp/archive v2.7.1...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.37.0...
- Installed hashicorp/aws v5.37.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (1 to add, 3 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.alarm_notifications_lambda will be updated in-place
  ~ resource "aws_lambda_function" "alarm_notifications_lambda" {
        id                             = "dev-alarm-notifications-lambda"
      ~ last_modified                  = "2025-02-28T16:39:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "N1A2BEgwBveveypJvkphN+dL54jvH0fFUfljcbInTL4=" -> "47DEQpj8HBSa+/TImW+5JCeuQeRkm5NMpJWZG3hSuFU="
        tags                           = {
            "CreatedBy"   = "prm-deductions-infra"
            "Environment" = "dev"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.generate_cost_report_lambda will be updated in-place
  ~ resource "aws_lambda_function" "generate_cost_report_lambda" {
        id                             = "dev-generate-cost-report-lambda"
      ~ last_modified                  = "2025-02-28T16:39:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "TBqV+Qp6jQ0Cw64ozRL9gi4AFxm9bPrSYo52+U//ThQ=" -> "47DEQpj8HBSa+/TImW+5JCeuQeRkm5NMpJWZG3hSuFU="
        tags                           = {
            "CreatedBy"   = "prm-deductions-infra"
            "Environment" = "dev"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_versioning.cost_and_usage_logs will be created
  + resource "aws_s3_bucket_versioning" "cost_and_usage_logs" {
      + bucket = "dev-cost-and-usage-access-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.deductions-private.aws_mq_broker.deductor_mq_broker will be updated in-place
  ~ resource "aws_mq_broker" "deductor_mq_broker" {
      ~ host_instance_type         = "mq.t3.micro" -> "mq.t2.micro"
        id                         = "b-09f25472-2c58-4386-ad2c-675ce15efbd6"
        tags                       = {
            "CreatedBy"   = "prm-deductions-infra"
            "Environment" = "dev"
        }
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

</details>